zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_AN_MMD.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_AN_MMD.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_AN_MMD
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_AN_MMD_H_)  /* Check if memory map has not been already included */
#define S32K566_AN_MMD_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- AN_MMD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AN_MMD_Peripheral_Access_Layer AN_MMD Peripheral Access Layer
 * @{
 */

/** AN_MMD - Register Layout Typedef */
typedef struct AN_MMD_Struct {
  __IO uint16_t SR_AN_CTRL;                        /**< SR AN MMD Control Register, offset: 0x0 */
  __I  uint16_t SR_AN_STS;                         /**< SR AN MMD Status Register, offset: 0x2 */
  __I  uint16_t SR_AN_DEV_ID1;                     /**< SR AN MMD Device Identifier Register 1, offset: 0x4 */
  __I  uint16_t SR_AN_DEV_ID2;                     /**< SR AN MMD Device Identifier Register 2, offset: 0x6 */
  uint8_t RESERVED_0[2];
  __I  uint16_t SR_AN_DEV_PKG1;                    /**< SR AN MMD Devices in Package Register 1, offset: 0xA */
  __I  uint16_t SR_AN_DEV_PKG2;                    /**< SR AN MMD Devices in Package Register 2, offset: 0xC */
  uint8_t RESERVED_1[14];
  __I  uint16_t SR_AN_PKG1;                        /**< SR AN MMD Package Identifier Register 1, offset: 0x1C */
  __I  uint16_t SR_AN_PKG2;                        /**< SR AN MMD Package Identifier Register 2, offset: 0x1E */
  __IO uint16_t SR_AN_ADV1;                        /**< SR AN MMD Advertisement Register 1 The AN Advertisement Register 1, 2, and 3 contain the Base Page Link Code Word for the local device., offset: 0x20 */
  __IO uint16_t SR_AN_ADV2;                        /**< SR AN MMD Advertisement Register 2, offset: 0x22 */
  __IO uint16_t SR_AN_ADV3;                        /**< SR AN MMD Advertisement Register 3, offset: 0x24 */
  __I  uint16_t SR_AN_LP_ABL1;                     /**< SR_AN_LP_ABL1, offset: 0x26 */
  __I  uint16_t SR_AN_LP_ABL2;                     /**< SR AN MMD LP Base Page Ability Register 2, offset: 0x28 */
  __I  uint16_t SR_AN_LP_ABL3;                     /**< SR AN MMD LP Base Page Ability Register 3, offset: 0x2A */
  __IO uint16_t SR_AN_XNP_TX1;                     /**< SR_AN_XNP_TX1, offset: 0x2C */
  __IO uint16_t SR_AN_XNP_TX2;                     /**< SR AN MMD XNP Transmit Register 2, offset: 0x2E */
  __IO uint16_t SR_AN_XNP_TX3;                     /**< SR AN MMD XNP Transmit Register 3, offset: 0x30 */
  __I  uint16_t SR_AN_LP_XNP_ABL1;                 /**< SR_AN_LP_XNP_ABL1, offset: 0x32 */
  __I  uint16_t SR_AN_LP_XNP_ABL2;                 /**< SR AN MMD LP XNP Ability Register 2, offset: 0x34 */
  __I  uint16_t SR_AN_LP_XNP_ABL3;                 /**< SR AN MMD LP XNP Ability Register 3, offset: 0x36 */
  uint8_t RESERVED_2[40];
  __I  uint16_t SR_AN_COMP_STS;                    /**< SR AN MMD Completion Status Register, offset: 0x60 */
  uint8_t RESERVED_3[22];
  __IO uint16_t SR_AN_EEE_ABL1;                    /**< SR AN MMD EEE Capability 1 Register, offset: 0x78 */
  __I  uint16_t SR_AN_EEE_LP_ABL1;                 /**< SR AN MMD EEE Link Partner Capability Register, offset: 0x7A */
  __IO uint16_t SR_AN_EEE_ABL2;                    /**< SR AN MMD EEE Capability 2 Register, offset: 0x7C */
  __I  uint16_t SR_AN_EEE_LP_ABL2;                 /**< SR AN MMD EEE Link Partner Capability 2 Register, offset: 0x7E */
  uint8_t RESERVED_4[65408];
  __IO uint16_t VR_AN_DIG_CTRL1;                   /**< VR AN MMD Digital Control1 Register, offset: 0x10000 */
  __IO uint16_t VR_AN_INTR_MSK;                    /**< VR AN MMD Interrupt Mask Register, offset: 0x10002 */
  __IO uint16_t VR_AN_INTR;                        /**< VR AN MMD Interrupt Register Note: The interrupt output port 'sbd_intr_o' goes high when any bit of this register is set along with the corresponding bit of VR_AN_INTR_MSK Register., offset: 0x10004 */
  __I  uint16_t VR_AN_KR_MODE_CTRL;                /**< VR AN MMD KR Mode Control Register, offset: 0x10006 */
  __IO uint16_t VR_AN_TIMER_CTRL0;                 /**< VR AN MMD Timer Control 0 Register, offset: 0x10008 */
  __IO uint16_t VR_AN_TIMER_CTRL1;                 /**< VR AN MMD Timer Control 1 Register, offset: 0x1000A */
  uint8_t RESERVED_5[20];
  __I  uint16_t VR_AN_DIG_STS;                     /**< VR AN MMD Digital Status Register, offset: 0x10020 */
} AN_MMD_Type, *AN_MMD_MemMapPtr;

/** Number of instances of the AN_MMD module. */
#define AN_MMD_INSTANCE_COUNT                    (1u)

/* AN_MMD - Peripheral instance base addresses */
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__AN_MMD base address */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__AN_MMD_BASE (0x8E0000u)
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__AN_MMD base pointer */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__AN_MMD ((AN_MMD_Type *)IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__AN_MMD_BASE)
/** Array initializer of AN_MMD peripheral base addresses */
#define IP_AN_MMD_BASE_ADDRS                     { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__AN_MMD_BASE }
/** Array initializer of AN_MMD peripheral base pointers */
#define IP_AN_MMD_BASE_PTRS                      { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__AN_MMD }

/* ----------------------------------------------------------------------------
   -- AN_MMD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AN_MMD_Register_Masks AN_MMD Register Masks
 * @{
 */

