zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_AN_MMD.h
/*! @name SR_AN_CTRL - SR AN MMD Control Register */
/*! @{ */

#define AN_MMD_SR_AN_CTRL_RSTRT_AN_MASK          (0x200U)
#define AN_MMD_SR_AN_CTRL_RSTRT_AN_SHIFT         (9U)
#define AN_MMD_SR_AN_CTRL_RSTRT_AN_WIDTH         (1U)
#define AN_MMD_SR_AN_CTRL_RSTRT_AN(x)            (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_CTRL_RSTRT_AN_SHIFT)) & AN_MMD_SR_AN_CTRL_RSTRT_AN_MASK)

#define AN_MMD_SR_AN_CTRL_LPM_MASK               (0x800U)
#define AN_MMD_SR_AN_CTRL_LPM_SHIFT              (11U)
#define AN_MMD_SR_AN_CTRL_LPM_WIDTH              (1U)
#define AN_MMD_SR_AN_CTRL_LPM(x)                 (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_CTRL_LPM_SHIFT)) & AN_MMD_SR_AN_CTRL_LPM_MASK)

#define AN_MMD_SR_AN_CTRL_AN_EN_MASK             (0x1000U)
#define AN_MMD_SR_AN_CTRL_AN_EN_SHIFT            (12U)
#define AN_MMD_SR_AN_CTRL_AN_EN_WIDTH            (1U)
#define AN_MMD_SR_AN_CTRL_AN_EN(x)               (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_CTRL_AN_EN_SHIFT)) & AN_MMD_SR_AN_CTRL_AN_EN_MASK)

#define AN_MMD_SR_AN_CTRL_EXT_NP_CTL_MASK        (0x2000U)
#define AN_MMD_SR_AN_CTRL_EXT_NP_CTL_SHIFT       (13U)
#define AN_MMD_SR_AN_CTRL_EXT_NP_CTL_WIDTH       (1U)
#define AN_MMD_SR_AN_CTRL_EXT_NP_CTL(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_CTRL_EXT_NP_CTL_SHIFT)) & AN_MMD_SR_AN_CTRL_EXT_NP_CTL_MASK)

#define AN_MMD_SR_AN_CTRL_AN_RST_MASK            (0x8000U)
#define AN_MMD_SR_AN_CTRL_AN_RST_SHIFT           (15U)
#define AN_MMD_SR_AN_CTRL_AN_RST_WIDTH           (1U)
#define AN_MMD_SR_AN_CTRL_AN_RST(x)              (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_CTRL_AN_RST_SHIFT)) & AN_MMD_SR_AN_CTRL_AN_RST_MASK)
/*! @} */

/*! @name SR_AN_STS - SR AN MMD Status Register */
/*! @{ */

#define AN_MMD_SR_AN_STS_LP_AN_ABL_MASK          (0x1U)
#define AN_MMD_SR_AN_STS_LP_AN_ABL_SHIFT         (0U)
#define AN_MMD_SR_AN_STS_LP_AN_ABL_WIDTH         (1U)
#define AN_MMD_SR_AN_STS_LP_AN_ABL(x)            (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_STS_LP_AN_ABL_SHIFT)) & AN_MMD_SR_AN_STS_LP_AN_ABL_MASK)

#define AN_MMD_SR_AN_STS_AN_LS_MASK              (0x4U)
#define AN_MMD_SR_AN_STS_AN_LS_SHIFT             (2U)
#define AN_MMD_SR_AN_STS_AN_LS_WIDTH             (1U)
#define AN_MMD_SR_AN_STS_AN_LS(x)                (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_STS_AN_LS_SHIFT)) & AN_MMD_SR_AN_STS_AN_LS_MASK)

#define AN_MMD_SR_AN_STS_AN_ABL_MASK             (0x8U)
#define AN_MMD_SR_AN_STS_AN_ABL_SHIFT            (3U)
#define AN_MMD_SR_AN_STS_AN_ABL_WIDTH            (1U)
#define AN_MMD_SR_AN_STS_AN_ABL(x)               (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_STS_AN_ABL_SHIFT)) & AN_MMD_SR_AN_STS_AN_ABL_MASK)

#define AN_MMD_SR_AN_STS_AN_RF_MASK              (0x10U)
#define AN_MMD_SR_AN_STS_AN_RF_SHIFT             (4U)
#define AN_MMD_SR_AN_STS_AN_RF_WIDTH             (1U)
#define AN_MMD_SR_AN_STS_AN_RF(x)                (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_STS_AN_RF_SHIFT)) & AN_MMD_SR_AN_STS_AN_RF_MASK)

#define AN_MMD_SR_AN_STS_ANC_MASK                (0x20U)
#define AN_MMD_SR_AN_STS_ANC_SHIFT               (5U)
#define AN_MMD_SR_AN_STS_ANC_WIDTH               (1U)
#define AN_MMD_SR_AN_STS_ANC(x)                  (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_STS_ANC_SHIFT)) & AN_MMD_SR_AN_STS_ANC_MASK)

#define AN_MMD_SR_AN_STS_PR_MASK                 (0x40U)
#define AN_MMD_SR_AN_STS_PR_SHIFT                (6U)
#define AN_MMD_SR_AN_STS_PR_WIDTH                (1U)
#define AN_MMD_SR_AN_STS_PR(x)                   (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_STS_PR_SHIFT)) & AN_MMD_SR_AN_STS_PR_MASK)

#define AN_MMD_SR_AN_STS_EXT_NP_STS_MASK         (0x80U)
#define AN_MMD_SR_AN_STS_EXT_NP_STS_SHIFT        (7U)
#define AN_MMD_SR_AN_STS_EXT_NP_STS_WIDTH        (1U)
#define AN_MMD_SR_AN_STS_EXT_NP_STS(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_STS_EXT_NP_STS_SHIFT)) & AN_MMD_SR_AN_STS_EXT_NP_STS_MASK)

#define AN_MMD_SR_AN_STS_PDF_MASK                (0x200U)
#define AN_MMD_SR_AN_STS_PDF_SHIFT               (9U)
#define AN_MMD_SR_AN_STS_PDF_WIDTH               (1U)
#define AN_MMD_SR_AN_STS_PDF(x)                  (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_STS_PDF_SHIFT)) & AN_MMD_SR_AN_STS_PDF_MASK)
/*! @} */

/*! @name SR_AN_DEV_ID1 - SR AN MMD Device Identifier Register 1 */
/*! @{ */

#define AN_MMD_SR_AN_DEV_ID1_AN_DEV_OUI_3_18_MASK (0xFFFFU)
#define AN_MMD_SR_AN_DEV_ID1_AN_DEV_OUI_3_18_SHIFT (0U)
#define AN_MMD_SR_AN_DEV_ID1_AN_DEV_OUI_3_18_WIDTH (16U)
#define AN_MMD_SR_AN_DEV_ID1_AN_DEV_OUI_3_18(x)  (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_ID1_AN_DEV_OUI_3_18_SHIFT)) & AN_MMD_SR_AN_DEV_ID1_AN_DEV_OUI_3_18_MASK)
/*! @} */

/*! @name SR_AN_DEV_ID2 - SR AN MMD Device Identifier Register 2 */
/*! @{ */

#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_RN_3_0_MASK  (0xFU)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_RN_3_0_SHIFT (0U)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_RN_3_0_WIDTH (4U)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_RN_3_0(x)    (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_ID2_AN_DEV_RN_3_0_SHIFT)) & AN_MMD_SR_AN_DEV_ID2_AN_DEV_RN_3_0_MASK)

#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_MMN_5_0_MASK (0x3F0U)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_MMN_5_0_SHIFT (4U)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_MMN_5_0_WIDTH (6U)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_MMN_5_0(x)   (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_ID2_AN_DEV_MMN_5_0_SHIFT)) & AN_MMD_SR_AN_DEV_ID2_AN_DEV_MMN_5_0_MASK)

#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_OUI_19_24_MASK (0xFC00U)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_OUI_19_24_SHIFT (10U)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_OUI_19_24_WIDTH (6U)
#define AN_MMD_SR_AN_DEV_ID2_AN_DEV_OUI_19_24(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_ID2_AN_DEV_OUI_19_24_SHIFT)) & AN_MMD_SR_AN_DEV_ID2_AN_DEV_OUI_19_24_MASK)
/*! @} */

/*! @name SR_AN_DEV_PKG1 - SR AN MMD Devices in Package Register 1 */
/*! @{ */

#define AN_MMD_SR_AN_DEV_PKG1_CLS22_MASK         (0x1U)
#define AN_MMD_SR_AN_DEV_PKG1_CLS22_SHIFT        (0U)
#define AN_MMD_SR_AN_DEV_PKG1_CLS22_WIDTH        (1U)
#define AN_MMD_SR_AN_DEV_PKG1_CLS22(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG1_CLS22_SHIFT)) & AN_MMD_SR_AN_DEV_PKG1_CLS22_MASK)

#define AN_MMD_SR_AN_DEV_PKG1_PMA_PMD_MASK       (0x2U)
#define AN_MMD_SR_AN_DEV_PKG1_PMA_PMD_SHIFT      (1U)
#define AN_MMD_SR_AN_DEV_PKG1_PMA_PMD_WIDTH      (1U)
#define AN_MMD_SR_AN_DEV_PKG1_PMA_PMD(x)         (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG1_PMA_PMD_SHIFT)) & AN_MMD_SR_AN_DEV_PKG1_PMA_PMD_MASK)

#define AN_MMD_SR_AN_DEV_PKG1_WIS_MASK           (0x4U)
#define AN_MMD_SR_AN_DEV_PKG1_WIS_SHIFT          (2U)
#define AN_MMD_SR_AN_DEV_PKG1_WIS_WIDTH          (1U)
#define AN_MMD_SR_AN_DEV_PKG1_WIS(x)             (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG1_WIS_SHIFT)) & AN_MMD_SR_AN_DEV_PKG1_WIS_MASK)

