zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_AN_MMD.h
#define AN_MMD_SR_AN_DEV_PKG1_PCS_MASK           (0x8U)
#define AN_MMD_SR_AN_DEV_PKG1_PCS_SHIFT          (3U)
#define AN_MMD_SR_AN_DEV_PKG1_PCS_WIDTH          (1U)
#define AN_MMD_SR_AN_DEV_PKG1_PCS(x)             (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG1_PCS_SHIFT)) & AN_MMD_SR_AN_DEV_PKG1_PCS_MASK)

#define AN_MMD_SR_AN_DEV_PKG1_PHYXS_MASK         (0x10U)
#define AN_MMD_SR_AN_DEV_PKG1_PHYXS_SHIFT        (4U)
#define AN_MMD_SR_AN_DEV_PKG1_PHYXS_WIDTH        (1U)
#define AN_MMD_SR_AN_DEV_PKG1_PHYXS(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG1_PHYXS_SHIFT)) & AN_MMD_SR_AN_DEV_PKG1_PHYXS_MASK)

#define AN_MMD_SR_AN_DEV_PKG1_DTEXS_MASK         (0x20U)
#define AN_MMD_SR_AN_DEV_PKG1_DTEXS_SHIFT        (5U)
#define AN_MMD_SR_AN_DEV_PKG1_DTEXS_WIDTH        (1U)
#define AN_MMD_SR_AN_DEV_PKG1_DTEXS(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG1_DTEXS_SHIFT)) & AN_MMD_SR_AN_DEV_PKG1_DTEXS_MASK)

#define AN_MMD_SR_AN_DEV_PKG1_TC_MASK            (0x40U)
#define AN_MMD_SR_AN_DEV_PKG1_TC_SHIFT           (6U)
#define AN_MMD_SR_AN_DEV_PKG1_TC_WIDTH           (1U)
#define AN_MMD_SR_AN_DEV_PKG1_TC(x)              (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG1_TC_SHIFT)) & AN_MMD_SR_AN_DEV_PKG1_TC_MASK)

#define AN_MMD_SR_AN_DEV_PKG1_AN_MASK            (0x80U)
#define AN_MMD_SR_AN_DEV_PKG1_AN_SHIFT           (7U)
#define AN_MMD_SR_AN_DEV_PKG1_AN_WIDTH           (1U)
#define AN_MMD_SR_AN_DEV_PKG1_AN(x)              (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG1_AN_SHIFT)) & AN_MMD_SR_AN_DEV_PKG1_AN_MASK)
/*! @} */

/*! @name SR_AN_DEV_PKG2 - SR AN MMD Devices in Package Register 2 */
/*! @{ */

#define AN_MMD_SR_AN_DEV_PKG2_VSD1_MASK          (0x4000U)
#define AN_MMD_SR_AN_DEV_PKG2_VSD1_SHIFT         (14U)
#define AN_MMD_SR_AN_DEV_PKG2_VSD1_WIDTH         (1U)
#define AN_MMD_SR_AN_DEV_PKG2_VSD1(x)            (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG2_VSD1_SHIFT)) & AN_MMD_SR_AN_DEV_PKG2_VSD1_MASK)

#define AN_MMD_SR_AN_DEV_PKG2_VSD2_MASK          (0x8000U)
#define AN_MMD_SR_AN_DEV_PKG2_VSD2_SHIFT         (15U)
#define AN_MMD_SR_AN_DEV_PKG2_VSD2_WIDTH         (1U)
#define AN_MMD_SR_AN_DEV_PKG2_VSD2(x)            (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_DEV_PKG2_VSD2_SHIFT)) & AN_MMD_SR_AN_DEV_PKG2_VSD2_MASK)
/*! @} */

/*! @name SR_AN_PKG1 - SR AN MMD Package Identifier Register 1 */
/*! @{ */

#define AN_MMD_SR_AN_PKG1_AN_PKG_OUI_3_18_MASK   (0xFFFFU)
#define AN_MMD_SR_AN_PKG1_AN_PKG_OUI_3_18_SHIFT  (0U)
#define AN_MMD_SR_AN_PKG1_AN_PKG_OUI_3_18_WIDTH  (16U)
#define AN_MMD_SR_AN_PKG1_AN_PKG_OUI_3_18(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_PKG1_AN_PKG_OUI_3_18_SHIFT)) & AN_MMD_SR_AN_PKG1_AN_PKG_OUI_3_18_MASK)
/*! @} */

/*! @name SR_AN_PKG2 - SR AN MMD Package Identifier Register 2 */
/*! @{ */

#define AN_MMD_SR_AN_PKG2_AN_PKG_RN_3_0_MASK     (0xFU)
#define AN_MMD_SR_AN_PKG2_AN_PKG_RN_3_0_SHIFT    (0U)
#define AN_MMD_SR_AN_PKG2_AN_PKG_RN_3_0_WIDTH    (4U)
#define AN_MMD_SR_AN_PKG2_AN_PKG_RN_3_0(x)       (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_PKG2_AN_PKG_RN_3_0_SHIFT)) & AN_MMD_SR_AN_PKG2_AN_PKG_RN_3_0_MASK)

#define AN_MMD_SR_AN_PKG2_AN_PKG_MMN_5_0_MASK    (0x3F0U)
#define AN_MMD_SR_AN_PKG2_AN_PKG_MMN_5_0_SHIFT   (4U)
#define AN_MMD_SR_AN_PKG2_AN_PKG_MMN_5_0_WIDTH   (6U)
#define AN_MMD_SR_AN_PKG2_AN_PKG_MMN_5_0(x)      (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_PKG2_AN_PKG_MMN_5_0_SHIFT)) & AN_MMD_SR_AN_PKG2_AN_PKG_MMN_5_0_MASK)

#define AN_MMD_SR_AN_PKG2_AN_PKG_OUI_19_24_MASK  (0xFC00U)
#define AN_MMD_SR_AN_PKG2_AN_PKG_OUI_19_24_SHIFT (10U)
#define AN_MMD_SR_AN_PKG2_AN_PKG_OUI_19_24_WIDTH (6U)
#define AN_MMD_SR_AN_PKG2_AN_PKG_OUI_19_24(x)    (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_PKG2_AN_PKG_OUI_19_24_SHIFT)) & AN_MMD_SR_AN_PKG2_AN_PKG_OUI_19_24_MASK)
/*! @} */

/*! @name SR_AN_ADV1 - SR AN MMD Advertisement Register 1 The AN Advertisement Register 1, 2, and 3 contain the Base Page Link Code Word for the local device. */
/*! @{ */

#define AN_MMD_SR_AN_ADV1_AN_ADV_SF_MASK         (0x1FU)
#define AN_MMD_SR_AN_ADV1_AN_ADV_SF_SHIFT        (0U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_SF_WIDTH        (5U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_SF(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_ADV1_AN_ADV_SF_SHIFT)) & AN_MMD_SR_AN_ADV1_AN_ADV_SF_MASK)

#define AN_MMD_SR_AN_ADV1_DATA_MASK              (0xFE0U)
#define AN_MMD_SR_AN_ADV1_DATA_SHIFT             (5U)
#define AN_MMD_SR_AN_ADV1_DATA_WIDTH             (7U)
#define AN_MMD_SR_AN_ADV1_DATA(x)                (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_ADV1_DATA_SHIFT)) & AN_MMD_SR_AN_ADV1_DATA_MASK)

#define AN_MMD_SR_AN_ADV1_AN_ADV_RF_13_MASK      (0x2000U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_RF_13_SHIFT     (13U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_RF_13_WIDTH     (1U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_RF_13(x)        (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_ADV1_AN_ADV_RF_13_SHIFT)) & AN_MMD_SR_AN_ADV1_AN_ADV_RF_13_MASK)

#define AN_MMD_SR_AN_ADV1_AN_ADV_ACK_MASK        (0x4000U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_ACK_SHIFT       (14U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_ACK_WIDTH       (1U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_ACK(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_ADV1_AN_ADV_ACK_SHIFT)) & AN_MMD_SR_AN_ADV1_AN_ADV_ACK_MASK)

#define AN_MMD_SR_AN_ADV1_AN_ADV_NP_MASK         (0x8000U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_NP_SHIFT        (15U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_NP_WIDTH        (1U)
#define AN_MMD_SR_AN_ADV1_AN_ADV_NP(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_ADV1_AN_ADV_NP_SHIFT)) & AN_MMD_SR_AN_ADV1_AN_ADV_NP_MASK)
/*! @} */

/*! @name SR_AN_ADV2 - SR AN MMD Advertisement Register 2 */
/*! @{ */

#define AN_MMD_SR_AN_ADV2_DATA_31_16_MASK        (0xFFFFU)
#define AN_MMD_SR_AN_ADV2_DATA_31_16_SHIFT       (0U)
#define AN_MMD_SR_AN_ADV2_DATA_31_16_WIDTH       (16U)
#define AN_MMD_SR_AN_ADV2_DATA_31_16(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_ADV2_DATA_31_16_SHIFT)) & AN_MMD_SR_AN_ADV2_DATA_31_16_MASK)
/*! @} */

/*! @name SR_AN_ADV3 - SR AN MMD Advertisement Register 3 */
/*! @{ */

#define AN_MMD_SR_AN_ADV3_DATA_47_32_MASK        (0xFFFFU)
#define AN_MMD_SR_AN_ADV3_DATA_47_32_SHIFT       (0U)
#define AN_MMD_SR_AN_ADV3_DATA_47_32_WIDTH       (16U)
#define AN_MMD_SR_AN_ADV3_DATA_47_32(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_ADV3_DATA_47_32_SHIFT)) & AN_MMD_SR_AN_ADV3_DATA_47_32_MASK)
/*! @} */

/*! @name SR_AN_LP_ABL1 - SR_AN_LP_ABL1 */
/*! @{ */

#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_SF_MASK   (0x1FU)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_SF_SHIFT  (0U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_SF_WIDTH  (5U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_SF(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_SF_SHIFT)) & AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_SF_MASK)

#define AN_MMD_SR_AN_LP_ABL1_DATA_MASK           (0xFE0U)
#define AN_MMD_SR_AN_LP_ABL1_DATA_SHIFT          (5U)
#define AN_MMD_SR_AN_LP_ABL1_DATA_WIDTH          (7U)
#define AN_MMD_SR_AN_LP_ABL1_DATA(x)             (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_ABL1_DATA_SHIFT)) & AN_MMD_SR_AN_LP_ABL1_DATA_MASK)

#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_RF_MASK   (0x2000U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_RF_SHIFT  (13U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_RF_WIDTH  (1U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_RF(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_RF_SHIFT)) & AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_RF_MASK)

#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_ACK_MASK  (0x4000U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_ACK_SHIFT (14U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_ACK_WIDTH (1U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_ACK(x)    (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_ACK_SHIFT)) & AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_ACK_MASK)

#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_NP_MASK   (0x8000U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_NP_SHIFT  (15U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_NP_WIDTH  (1U)
#define AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_NP(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_NP_SHIFT)) & AN_MMD_SR_AN_LP_ABL1_AN_LP_ADV_NP_MASK)
/*! @} */

/*! @name SR_AN_LP_ABL2 - SR AN MMD LP Base Page Ability Register 2 */
/*! @{ */

#define AN_MMD_SR_AN_LP_ABL2_DATA_31_16_MASK     (0xFFFFU)
#define AN_MMD_SR_AN_LP_ABL2_DATA_31_16_SHIFT    (0U)
#define AN_MMD_SR_AN_LP_ABL2_DATA_31_16_WIDTH    (16U)
#define AN_MMD_SR_AN_LP_ABL2_DATA_31_16(x)       (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_ABL2_DATA_31_16_SHIFT)) & AN_MMD_SR_AN_LP_ABL2_DATA_31_16_MASK)
/*! @} */

