zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_AN_MMD.h
/*! @name SR_AN_LP_ABL3 - SR AN MMD LP Base Page Ability Register 3 */
/*! @{ */

#define AN_MMD_SR_AN_LP_ABL3_DATA_47_32_MASK     (0xFFFFU)
#define AN_MMD_SR_AN_LP_ABL3_DATA_47_32_SHIFT    (0U)
#define AN_MMD_SR_AN_LP_ABL3_DATA_47_32_WIDTH    (16U)
#define AN_MMD_SR_AN_LP_ABL3_DATA_47_32(x)       (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_ABL3_DATA_47_32_SHIFT)) & AN_MMD_SR_AN_LP_ABL3_DATA_47_32_MASK)
/*! @} */

/*! @name SR_AN_XNP_TX1 - SR_AN_XNP_TX1 */
/*! @{ */

#define AN_MMD_SR_AN_XNP_TX1_MCF_MASK            (0x7FFU)
#define AN_MMD_SR_AN_XNP_TX1_MCF_SHIFT           (0U)
#define AN_MMD_SR_AN_XNP_TX1_MCF_WIDTH           (11U)
#define AN_MMD_SR_AN_XNP_TX1_MCF(x)              (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_XNP_TX1_MCF_SHIFT)) & AN_MMD_SR_AN_XNP_TX1_MCF_MASK)

#define AN_MMD_SR_AN_XNP_TX1_TB_MASK             (0x800U)
#define AN_MMD_SR_AN_XNP_TX1_TB_SHIFT            (11U)
#define AN_MMD_SR_AN_XNP_TX1_TB_WIDTH            (1U)
#define AN_MMD_SR_AN_XNP_TX1_TB(x)               (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_XNP_TX1_TB_SHIFT)) & AN_MMD_SR_AN_XNP_TX1_TB_MASK)

#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_ACK2_MASK    (0x1000U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_ACK2_SHIFT   (12U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_ACK2_WIDTH   (1U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_ACK2(x)      (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_XNP_TX1_AN_XNP_ACK2_SHIFT)) & AN_MMD_SR_AN_XNP_TX1_AN_XNP_ACK2_MASK)

#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_MP_MASK      (0x2000U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_MP_SHIFT     (13U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_MP_WIDTH     (1U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_MP(x)        (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_XNP_TX1_AN_XNP_MP_SHIFT)) & AN_MMD_SR_AN_XNP_TX1_AN_XNP_MP_MASK)

#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_NP_MASK      (0x8000U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_NP_SHIFT     (15U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_NP_WIDTH     (1U)
#define AN_MMD_SR_AN_XNP_TX1_AN_XNP_NP(x)        (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_XNP_TX1_AN_XNP_NP_SHIFT)) & AN_MMD_SR_AN_XNP_TX1_AN_XNP_NP_MASK)
/*! @} */

/*! @name SR_AN_XNP_TX2 - SR AN MMD XNP Transmit Register 2 */
/*! @{ */

#define AN_MMD_SR_AN_XNP_TX2_UMCF1_MASK          (0xFFFFU)
#define AN_MMD_SR_AN_XNP_TX2_UMCF1_SHIFT         (0U)
#define AN_MMD_SR_AN_XNP_TX2_UMCF1_WIDTH         (16U)
#define AN_MMD_SR_AN_XNP_TX2_UMCF1(x)            (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_XNP_TX2_UMCF1_SHIFT)) & AN_MMD_SR_AN_XNP_TX2_UMCF1_MASK)
/*! @} */

/*! @name SR_AN_XNP_TX3 - SR AN MMD XNP Transmit Register 3 */
/*! @{ */

#define AN_MMD_SR_AN_XNP_TX3_UMCF2_MASK          (0xFFFFU)
#define AN_MMD_SR_AN_XNP_TX3_UMCF2_SHIFT         (0U)
#define AN_MMD_SR_AN_XNP_TX3_UMCF2_WIDTH         (16U)
#define AN_MMD_SR_AN_XNP_TX3_UMCF2(x)            (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_XNP_TX3_UMCF2_SHIFT)) & AN_MMD_SR_AN_XNP_TX3_UMCF2_MASK)
/*! @} */

/*! @name SR_AN_LP_XNP_ABL1 - SR_AN_LP_XNP_ABL1 */
/*! @{ */

#define AN_MMD_SR_AN_LP_XNP_ABL1_MCF_MASK        (0x7FFU)
#define AN_MMD_SR_AN_LP_XNP_ABL1_MCF_SHIFT       (0U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_MCF_WIDTH       (11U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_MCF(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_XNP_ABL1_MCF_SHIFT)) & AN_MMD_SR_AN_LP_XNP_ABL1_MCF_MASK)

#define AN_MMD_SR_AN_LP_XNP_ABL1_TB_MASK         (0x800U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_TB_SHIFT        (11U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_TB_WIDTH        (1U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_TB(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_XNP_ABL1_TB_SHIFT)) & AN_MMD_SR_AN_LP_XNP_ABL1_TB_MASK)

#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK2_MASK (0x1000U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK2_SHIFT (12U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK2_WIDTH (1U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK2(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK2_SHIFT)) & AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK2_MASK)

#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_MP_MASK (0x2000U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_MP_SHIFT (13U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_MP_WIDTH (1U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_MP(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_MP_SHIFT)) & AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_MP_MASK)

#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK_MASK (0x4000U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK_SHIFT (14U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK_WIDTH (1U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK_SHIFT)) & AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_ACK_MASK)

#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_NP_MASK (0x8000U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_NP_SHIFT (15U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_NP_WIDTH (1U)
#define AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_NP(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_NP_SHIFT)) & AN_MMD_SR_AN_LP_XNP_ABL1_AN_LP_XNP_NP_MASK)
/*! @} */

/*! @name SR_AN_LP_XNP_ABL2 - SR AN MMD LP XNP Ability Register 2 */
/*! @{ */

#define AN_MMD_SR_AN_LP_XNP_ABL2_UCF1_MASK       (0xFFFFU)
#define AN_MMD_SR_AN_LP_XNP_ABL2_UCF1_SHIFT      (0U)
#define AN_MMD_SR_AN_LP_XNP_ABL2_UCF1_WIDTH      (16U)
#define AN_MMD_SR_AN_LP_XNP_ABL2_UCF1(x)         (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_XNP_ABL2_UCF1_SHIFT)) & AN_MMD_SR_AN_LP_XNP_ABL2_UCF1_MASK)
/*! @} */

/*! @name SR_AN_LP_XNP_ABL3 - SR AN MMD LP XNP Ability Register 3 */
/*! @{ */

#define AN_MMD_SR_AN_LP_XNP_ABL3_UCF2_MASK       (0xFFFFU)
#define AN_MMD_SR_AN_LP_XNP_ABL3_UCF2_SHIFT      (0U)
#define AN_MMD_SR_AN_LP_XNP_ABL3_UCF2_WIDTH      (16U)
#define AN_MMD_SR_AN_LP_XNP_ABL3_UCF2(x)         (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_LP_XNP_ABL3_UCF2_SHIFT)) & AN_MMD_SR_AN_LP_XNP_ABL3_UCF2_MASK)
/*! @} */

/*! @name SR_AN_COMP_STS - SR AN MMD Completion Status Register */
/*! @{ */

#define AN_MMD_SR_AN_COMP_STS_BP_AN_ABL_MASK     (0x1U)
#define AN_MMD_SR_AN_COMP_STS_BP_AN_ABL_SHIFT    (0U)
#define AN_MMD_SR_AN_COMP_STS_BP_AN_ABL_WIDTH    (1U)
#define AN_MMD_SR_AN_COMP_STS_BP_AN_ABL(x)       (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_COMP_STS_BP_AN_ABL_SHIFT)) & AN_MMD_SR_AN_COMP_STS_BP_AN_ABL_MASK)

#define AN_MMD_SR_AN_COMP_STS_AN_COMP_KX_MASK    (0x2U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_KX_SHIFT   (1U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_KX_WIDTH   (1U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_KX(x)      (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_COMP_STS_AN_COMP_KX_SHIFT)) & AN_MMD_SR_AN_COMP_STS_AN_COMP_KX_MASK)

#define AN_MMD_SR_AN_COMP_STS_AN_COMP_FEC_MASK   (0x10U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_FEC_SHIFT  (4U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_FEC_WIDTH  (1U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_FEC(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_COMP_STS_AN_COMP_FEC_SHIFT)) & AN_MMD_SR_AN_COMP_STS_AN_COMP_FEC_MASK)

