zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_AN_MMD.h
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_2PT5G_MASK (0x4000U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_2PT5G_SHIFT (14U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_2PT5G_WIDTH (1U)
#define AN_MMD_SR_AN_COMP_STS_AN_COMP_2PT5G(x)   (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_COMP_STS_AN_COMP_2PT5G_SHIFT)) & AN_MMD_SR_AN_COMP_STS_AN_COMP_2PT5G_MASK)
/*! @} */

/*! @name SR_AN_EEE_ABL1 - SR AN MMD EEE Capability 1 Register */
/*! @{ */

#define AN_MMD_SR_AN_EEE_ABL1_EN_100TEE_MASK     (0x2U)
#define AN_MMD_SR_AN_EEE_ABL1_EN_100TEE_SHIFT    (1U)
#define AN_MMD_SR_AN_EEE_ABL1_EN_100TEE_WIDTH    (1U)
#define AN_MMD_SR_AN_EEE_ABL1_EN_100TEE(x)       (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL1_EN_100TEE_SHIFT)) & AN_MMD_SR_AN_EEE_ABL1_EN_100TEE_MASK)

#define AN_MMD_SR_AN_EEE_ABL1_EN_1GTEEE_MASK     (0x4U)
#define AN_MMD_SR_AN_EEE_ABL1_EN_1GTEEE_SHIFT    (2U)
#define AN_MMD_SR_AN_EEE_ABL1_EN_1GTEEE_WIDTH    (1U)
#define AN_MMD_SR_AN_EEE_ABL1_EN_1GTEEE(x)       (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL1_EN_1GTEEE_SHIFT)) & AN_MMD_SR_AN_EEE_ABL1_EN_1GTEEE_MASK)

#define AN_MMD_SR_AN_EEE_ABL1_TEEE_MASK          (0x8U)
#define AN_MMD_SR_AN_EEE_ABL1_TEEE_SHIFT         (3U)
#define AN_MMD_SR_AN_EEE_ABL1_TEEE_WIDTH         (1U)
#define AN_MMD_SR_AN_EEE_ABL1_TEEE(x)            (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL1_TEEE_SHIFT)) & AN_MMD_SR_AN_EEE_ABL1_TEEE_MASK)

#define AN_MMD_SR_AN_EEE_ABL1_KXEEE_MASK         (0x10U)
#define AN_MMD_SR_AN_EEE_ABL1_KXEEE_SHIFT        (4U)
#define AN_MMD_SR_AN_EEE_ABL1_KXEEE_WIDTH        (1U)
#define AN_MMD_SR_AN_EEE_ABL1_KXEEE(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL1_KXEEE_SHIFT)) & AN_MMD_SR_AN_EEE_ABL1_KXEEE_MASK)

#define AN_MMD_SR_AN_EEE_ABL1_KX4EEE_MASK        (0x20U)
#define AN_MMD_SR_AN_EEE_ABL1_KX4EEE_SHIFT       (5U)
#define AN_MMD_SR_AN_EEE_ABL1_KX4EEE_WIDTH       (1U)
#define AN_MMD_SR_AN_EEE_ABL1_KX4EEE(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL1_KX4EEE_SHIFT)) & AN_MMD_SR_AN_EEE_ABL1_KX4EEE_MASK)

#define AN_MMD_SR_AN_EEE_ABL1_KREEE_MASK         (0x40U)
#define AN_MMD_SR_AN_EEE_ABL1_KREEE_SHIFT        (6U)
#define AN_MMD_SR_AN_EEE_ABL1_KREEE_WIDTH        (1U)
#define AN_MMD_SR_AN_EEE_ABL1_KREEE(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL1_KREEE_SHIFT)) & AN_MMD_SR_AN_EEE_ABL1_KREEE_MASK)
/*! @} */

/*! @name SR_AN_EEE_LP_ABL1 - SR AN MMD EEE Link Partner Capability Register */
/*! @{ */

#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_100TEE_MASK  (0x2U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_100TEE_SHIFT (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_100TEE_WIDTH (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_100TEE(x)    (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_LP_ABL1_LP_100TEE_SHIFT)) & AN_MMD_SR_AN_EEE_LP_ABL1_LP_100TEE_MASK)

#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_1GTEEE_MASK  (0x4U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_1GTEEE_SHIFT (2U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_1GTEEE_WIDTH (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_1GTEEE(x)    (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_LP_ABL1_LP_1GTEEE_SHIFT)) & AN_MMD_SR_AN_EEE_LP_ABL1_LP_1GTEEE_MASK)

#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_TEEE_MASK    (0x8U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_TEEE_SHIFT   (3U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_TEEE_WIDTH   (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_TEEE(x)      (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_LP_ABL1_LP_TEEE_SHIFT)) & AN_MMD_SR_AN_EEE_LP_ABL1_LP_TEEE_MASK)

#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KXEEE_MASK   (0x10U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KXEEE_SHIFT  (4U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KXEEE_WIDTH  (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KXEEE(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_LP_ABL1_LP_KXEEE_SHIFT)) & AN_MMD_SR_AN_EEE_LP_ABL1_LP_KXEEE_MASK)

#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KX4EEE_MASK  (0x20U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KX4EEE_SHIFT (5U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KX4EEE_WIDTH (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KX4EEE(x)    (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_LP_ABL1_LP_KX4EEE_SHIFT)) & AN_MMD_SR_AN_EEE_LP_ABL1_LP_KX4EEE_MASK)

#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KREEE_MASK   (0x40U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KREEE_SHIFT  (6U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KREEE_WIDTH  (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL1_LP_KREEE(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_LP_ABL1_LP_KREEE_SHIFT)) & AN_MMD_SR_AN_EEE_LP_ABL1_LP_KREEE_MASK)
/*! @} */

/*! @name SR_AN_EEE_ABL2 - SR AN MMD EEE Capability 2 Register */
/*! @{ */

#define AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GT_MASK    (0x1U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GT_SHIFT   (0U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GT_WIDTH   (1U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GT(x)      (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GT_SHIFT)) & AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GT_MASK)

#define AN_MMD_SR_AN_EEE_ABL2_EEE_5GT_MASK       (0x2U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_5GT_SHIFT      (1U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_5GT_WIDTH      (1U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_5GT(x)         (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL2_EEE_5GT_SHIFT)) & AN_MMD_SR_AN_EEE_ABL2_EEE_5GT_MASK)

#define AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GKX_MASK   (0x4U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GKX_SHIFT  (2U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GKX_WIDTH  (1U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GKX(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GKX_SHIFT)) & AN_MMD_SR_AN_EEE_ABL2_EEE_2PT5GKX_MASK)

#define AN_MMD_SR_AN_EEE_ABL2_EEE_5GKR_MASK      (0x8U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_5GKR_SHIFT     (3U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_5GKR_WIDTH     (1U)
#define AN_MMD_SR_AN_EEE_ABL2_EEE_5GKR(x)        (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_ABL2_EEE_5GKR_SHIFT)) & AN_MMD_SR_AN_EEE_ABL2_EEE_5GKR_MASK)
/*! @} */

/*! @name SR_AN_EEE_LP_ABL2 - SR AN MMD EEE Link Partner Capability 2 Register */
/*! @{ */

#define AN_MMD_SR_AN_EEE_LP_ABL2_LP_2PT5GKXEEE_MASK (0x4U)
#define AN_MMD_SR_AN_EEE_LP_ABL2_LP_2PT5GKXEEE_SHIFT (2U)
#define AN_MMD_SR_AN_EEE_LP_ABL2_LP_2PT5GKXEEE_WIDTH (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL2_LP_2PT5GKXEEE(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_LP_ABL2_LP_2PT5GKXEEE_SHIFT)) & AN_MMD_SR_AN_EEE_LP_ABL2_LP_2PT5GKXEEE_MASK)

#define AN_MMD_SR_AN_EEE_LP_ABL2_LP_5GKREEE_MASK (0x8U)
#define AN_MMD_SR_AN_EEE_LP_ABL2_LP_5GKREEE_SHIFT (3U)
#define AN_MMD_SR_AN_EEE_LP_ABL2_LP_5GKREEE_WIDTH (1U)
#define AN_MMD_SR_AN_EEE_LP_ABL2_LP_5GKREEE(x)   (((uint16_t)(((uint16_t)(x)) << AN_MMD_SR_AN_EEE_LP_ABL2_LP_5GKREEE_SHIFT)) & AN_MMD_SR_AN_EEE_LP_ABL2_LP_5GKREEE_MASK)
/*! @} */

/*! @name VR_AN_DIG_CTRL1 - VR AN MMD Digital Control1 Register */
/*! @{ */

#define AN_MMD_VR_AN_DIG_CTRL1_BYP_PWRUP_MASK    (0x2U)
#define AN_MMD_VR_AN_DIG_CTRL1_BYP_PWRUP_SHIFT   (1U)
#define AN_MMD_VR_AN_DIG_CTRL1_BYP_PWRUP_WIDTH   (1U)
#define AN_MMD_VR_AN_DIG_CTRL1_BYP_PWRUP(x)      (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_DIG_CTRL1_BYP_PWRUP_SHIFT)) & AN_MMD_VR_AN_DIG_CTRL1_BYP_PWRUP_MASK)

