zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_AN_MMD.h
#define AN_MMD_VR_AN_DIG_CTRL1_BYP_NONCE_MAT_MASK (0x4U)
#define AN_MMD_VR_AN_DIG_CTRL1_BYP_NONCE_MAT_SHIFT (2U)
#define AN_MMD_VR_AN_DIG_CTRL1_BYP_NONCE_MAT_WIDTH (1U)
#define AN_MMD_VR_AN_DIG_CTRL1_BYP_NONCE_MAT(x)  (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_DIG_CTRL1_BYP_NONCE_MAT_SHIFT)) & AN_MMD_VR_AN_DIG_CTRL1_BYP_NONCE_MAT_MASK)

#define AN_MMD_VR_AN_DIG_CTRL1_CL73_TMR_OVR_RIDE_MASK (0x8U)
#define AN_MMD_VR_AN_DIG_CTRL1_CL73_TMR_OVR_RIDE_SHIFT (3U)
#define AN_MMD_VR_AN_DIG_CTRL1_CL73_TMR_OVR_RIDE_WIDTH (1U)
#define AN_MMD_VR_AN_DIG_CTRL1_CL73_TMR_OVR_RIDE(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_DIG_CTRL1_CL73_TMR_OVR_RIDE_SHIFT)) & AN_MMD_VR_AN_DIG_CTRL1_CL73_TMR_OVR_RIDE_MASK)

#define AN_MMD_VR_AN_DIG_CTRL1_PWRSV_MASK        (0x800U)
#define AN_MMD_VR_AN_DIG_CTRL1_PWRSV_SHIFT       (11U)
#define AN_MMD_VR_AN_DIG_CTRL1_PWRSV_WIDTH       (1U)
#define AN_MMD_VR_AN_DIG_CTRL1_PWRSV(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_DIG_CTRL1_PWRSV_SHIFT)) & AN_MMD_VR_AN_DIG_CTRL1_PWRSV_MASK)

#define AN_MMD_VR_AN_DIG_CTRL1_VR_RST_MASK       (0x8000U)
#define AN_MMD_VR_AN_DIG_CTRL1_VR_RST_SHIFT      (15U)
#define AN_MMD_VR_AN_DIG_CTRL1_VR_RST_WIDTH      (1U)
#define AN_MMD_VR_AN_DIG_CTRL1_VR_RST(x)         (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_DIG_CTRL1_VR_RST_SHIFT)) & AN_MMD_VR_AN_DIG_CTRL1_VR_RST_MASK)
/*! @} */

/*! @name VR_AN_INTR_MSK - VR AN MMD Interrupt Mask Register */
/*! @{ */

#define AN_MMD_VR_AN_INTR_MSK_AN_INT_CMPLT_IE_MASK (0x1U)
#define AN_MMD_VR_AN_INTR_MSK_AN_INT_CMPLT_IE_SHIFT (0U)
#define AN_MMD_VR_AN_INTR_MSK_AN_INT_CMPLT_IE_WIDTH (1U)
#define AN_MMD_VR_AN_INTR_MSK_AN_INT_CMPLT_IE(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_INTR_MSK_AN_INT_CMPLT_IE_SHIFT)) & AN_MMD_VR_AN_INTR_MSK_AN_INT_CMPLT_IE_MASK)

#define AN_MMD_VR_AN_INTR_MSK_AN_INC_LINK_IE_MASK (0x2U)
#define AN_MMD_VR_AN_INTR_MSK_AN_INC_LINK_IE_SHIFT (1U)
#define AN_MMD_VR_AN_INTR_MSK_AN_INC_LINK_IE_WIDTH (1U)
#define AN_MMD_VR_AN_INTR_MSK_AN_INC_LINK_IE(x)  (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_INTR_MSK_AN_INC_LINK_IE_SHIFT)) & AN_MMD_VR_AN_INTR_MSK_AN_INC_LINK_IE_MASK)

#define AN_MMD_VR_AN_INTR_MSK_AN_PG_RCV_IE_MASK  (0x4U)
#define AN_MMD_VR_AN_INTR_MSK_AN_PG_RCV_IE_SHIFT (2U)
#define AN_MMD_VR_AN_INTR_MSK_AN_PG_RCV_IE_WIDTH (1U)
#define AN_MMD_VR_AN_INTR_MSK_AN_PG_RCV_IE(x)    (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_INTR_MSK_AN_PG_RCV_IE_SHIFT)) & AN_MMD_VR_AN_INTR_MSK_AN_PG_RCV_IE_MASK)
/*! @} */

/*! @name VR_AN_INTR - VR AN MMD Interrupt Register Note: The interrupt output port 'sbd_intr_o' goes high when any bit of this register is set along with the corresponding bit of VR_AN_INTR_MSK Register. */
/*! @{ */

#define AN_MMD_VR_AN_INTR_AN_INT_CMPLT_MASK      (0x1U)
#define AN_MMD_VR_AN_INTR_AN_INT_CMPLT_SHIFT     (0U)
#define AN_MMD_VR_AN_INTR_AN_INT_CMPLT_WIDTH     (1U)
#define AN_MMD_VR_AN_INTR_AN_INT_CMPLT(x)        (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_INTR_AN_INT_CMPLT_SHIFT)) & AN_MMD_VR_AN_INTR_AN_INT_CMPLT_MASK)

#define AN_MMD_VR_AN_INTR_AN_INC_LINK_MASK       (0x2U)
#define AN_MMD_VR_AN_INTR_AN_INC_LINK_SHIFT      (1U)
#define AN_MMD_VR_AN_INTR_AN_INC_LINK_WIDTH      (1U)
#define AN_MMD_VR_AN_INTR_AN_INC_LINK(x)         (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_INTR_AN_INC_LINK_SHIFT)) & AN_MMD_VR_AN_INTR_AN_INC_LINK_MASK)

#define AN_MMD_VR_AN_INTR_AN_PG_RCV_MASK         (0x4U)
#define AN_MMD_VR_AN_INTR_AN_PG_RCV_SHIFT        (2U)
#define AN_MMD_VR_AN_INTR_AN_PG_RCV_WIDTH        (1U)
#define AN_MMD_VR_AN_INTR_AN_PG_RCV(x)           (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_INTR_AN_PG_RCV_SHIFT)) & AN_MMD_VR_AN_INTR_AN_PG_RCV_MASK)
/*! @} */

/*! @name VR_AN_KR_MODE_CTRL - VR AN MMD KR Mode Control Register */
/*! @{ */

#define AN_MMD_VR_AN_KR_MODE_CTRL_PDET_EN_MASK   (0x1U)
#define AN_MMD_VR_AN_KR_MODE_CTRL_PDET_EN_SHIFT  (0U)
#define AN_MMD_VR_AN_KR_MODE_CTRL_PDET_EN_WIDTH  (1U)
#define AN_MMD_VR_AN_KR_MODE_CTRL_PDET_EN(x)     (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_KR_MODE_CTRL_PDET_EN_SHIFT)) & AN_MMD_VR_AN_KR_MODE_CTRL_PDET_EN_MASK)
/*! @} */

/*! @name VR_AN_TIMER_CTRL0 - VR AN MMD Timer Control 0 Register */
/*! @{ */

#define AN_MMD_VR_AN_TIMER_CTRL0_BRK_LINK_TIME_MASK (0xFFFFU)
#define AN_MMD_VR_AN_TIMER_CTRL0_BRK_LINK_TIME_SHIFT (0U)
#define AN_MMD_VR_AN_TIMER_CTRL0_BRK_LINK_TIME_WIDTH (16U)
#define AN_MMD_VR_AN_TIMER_CTRL0_BRK_LINK_TIME(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_TIMER_CTRL0_BRK_LINK_TIME_SHIFT)) & AN_MMD_VR_AN_TIMER_CTRL0_BRK_LINK_TIME_MASK)
/*! @} */

/*! @name VR_AN_TIMER_CTRL1 - VR AN MMD Timer Control 1 Register */
/*! @{ */

#define AN_MMD_VR_AN_TIMER_CTRL1_INHBT_OR_WAIT_TIME_MASK (0xFFFFU)
#define AN_MMD_VR_AN_TIMER_CTRL1_INHBT_OR_WAIT_TIME_SHIFT (0U)
#define AN_MMD_VR_AN_TIMER_CTRL1_INHBT_OR_WAIT_TIME_WIDTH (16U)
#define AN_MMD_VR_AN_TIMER_CTRL1_INHBT_OR_WAIT_TIME(x) (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_TIMER_CTRL1_INHBT_OR_WAIT_TIME_SHIFT)) & AN_MMD_VR_AN_TIMER_CTRL1_INHBT_OR_WAIT_TIME_MASK)
/*! @} */

/*! @name VR_AN_DIG_STS - VR AN MMD Digital Status Register */
/*! @{ */

#define AN_MMD_VR_AN_DIG_STS_ANA_FSM_MASK        (0xFU)
#define AN_MMD_VR_AN_DIG_STS_ANA_FSM_SHIFT       (0U)
#define AN_MMD_VR_AN_DIG_STS_ANA_FSM_WIDTH       (4U)
#define AN_MMD_VR_AN_DIG_STS_ANA_FSM(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_DIG_STS_ANA_FSM_SHIFT)) & AN_MMD_VR_AN_DIG_STS_ANA_FSM_MASK)

#define AN_MMD_VR_AN_DIG_STS_ANR_FSM_MASK        (0x1F0U)
#define AN_MMD_VR_AN_DIG_STS_ANR_FSM_SHIFT       (4U)
#define AN_MMD_VR_AN_DIG_STS_ANR_FSM_WIDTH       (5U)
#define AN_MMD_VR_AN_DIG_STS_ANR_FSM(x)          (((uint16_t)(((uint16_t)(x)) << AN_MMD_VR_AN_DIG_STS_ANR_FSM_SHIFT)) & AN_MMD_VR_AN_DIG_STS_ANR_FSM_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group AN_MMD_Register_Masks */

/*!
 * @}
 */ /* end of group AN_MMD_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_AN_MMD_H_) */
